# strings
# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
# #################################################################################

l = []
st = input('Enter line:')
for i in st:
    if i.isdigit():
        l.append(i)
print(','.join(l))

# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################

l = []
st = input('Enter line:')
i = 0
while i < len(st):
    a = ''
    while st[i].isdigit():
        a += st[i]
        i += 1
        if i >= len(st):
            break
    i += 1
    if a != '':
        l.append(a)
print(','.join(l))

# list comprehension
# 1)есть строка:
# greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']

greeting = 'Hello, world'
print(list(greeting.upper()))

# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

r = [i ** 2 for i in range(51) if i % 2 != 0]  # так как в задании написано не парные
# числа, а в примере показаны все из диапазона
print(r)

# function
# - створити функцію яка виводить ліст
def li(l):
    print(l)


li([22, 'jjj', 2, -23, True, 23, 5])


# - створити функцію яка приймає три числа та виводить та повертає найменьше.
def some(n1, n2, n3):
    print(min(n1, n2, n3))
    return min(n1, n2, n3)


some(1, 4, 5)

# - створити функцію яка приймає три числа та виводить та повертає найбільше.
def some(n1, n2, n3):
    print(max(n1, n2, n3))
    return max(n1, n2, n3)


some(1, 4, 5)

# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
def some(*args):
    print(max(*args))
    return min(*args)


some(1, 4, 5, 564, 3, 34)
print(some(32482, 32, 34, 332, 456, 2341))

# - створити функцію яка виводить ліст
def li(list=[22, 'jjj', 2, -23, True, 23, 5]):
    print(list)


li()
# - створити функцію яка повертає найбільше число з ліста

def li(l):
    return max(l)


print(li([22, 55, 2, -23, 23, 5, 2982]))
# - створити функцію яка повертає найменьше число з ліста
def li(l):
    return min(l)


print(li([22, 55, 2, -23, 23, 5, -9]))

# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.


def li(l):
    i = 0
    s = 0
    while i < len(l):
        s += l[i]
        i += 1
    return s


print(li([2, 5, 5, 6, -3]))
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

def li(l):
    i = 0
    s = 0
    while i < len(l):
        s += l[i]
        i += 1
    return s / len(l)


print(li([2, 5, 5, 6, -3]))

# #################################################################################################
# 1)Дан лист:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
list = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
#   - найти min число в листе
print(min(list))
#   - удалить все дубликаты в листе
print(set(list))
#   - заменить каждое четвертое значение на "Х"
i = 3
while i < len(list):
    list[i] = 'X'
    i += 4
print(list)
# 2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:

n = int(input('Side:'))
for i in range(n):
    if i == 0 or i == n - 1:
        print('*' * n)
    else:
        print('*'+' '*(n-2)+'*') # если делать как на фото, которое вы прислали получается
        # прямоугольник (на фото верхняя и нижняя стороны равны 10, а боковые 12 )

# 3) вывести табличку умножения с помощью цикла while
i = 0
while i < 9:
    j = 1
    i += 1
    while j < 10:
        c = i * j
        print(c, end='\t')
        j += 1
    print('\n')

# 4) переделать первое задание под меню с помощью цикла
st = True
l = [5, 24, -33, -7, 32, 3, 5, 9, 0, -1, 2, 5]
while st:
    st = input('1)найти min число в листе' + '\n' +
               '2)удалить все дубликаты в листе' + '\n' +
               '3)заменить каждое четвертое значение на "Х"' + '\n' +
               '4)вывести элемент листа, значение которого ближе всего к среднему арифметическому всех' + '\n' +
               '5)выход\nСделайте свой выбор: ')
    if st == '1':
        print('list=', l)
        print('min_num:', min(l))
    elif st == '2':
        print('list=', l)
        print('Without duplicates', set(l))
    elif st == '3':
        print('list=', l)
        i = 3
        while i < len(l):
            l[i] = 'X'
            i += 4
        print('With X:', l)
    elif st == '4':
        print('list=', l)
        k, s, w = 0, 0, max(l)
        a = sum(l) / len(l)
        while k < len(l):
            if abs(a - l[k]) <= w:
                w = abs(a - l[k])
                s = l[k]
            k += 1
        print('Near average:', s)
    elif st == '5':
        break
    else:
        print('error')

# ***  - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
# пример:
# [1, 2, 3, 4, 5, 6, 7, 8, 9] => 5
# [-1, -2, 3, 4, 555] => 4
# [5, 5, 5, 5] => 5
# [-10, 5, 5] => 5
i, s, w = 0, 0, max(l)
a = sum(l) / len(l)
while i < len(l):
    if abs(a - l[i]) <= w:
        w = abs(a - l[i])
        s = l[i]
    i += 1
print(s)
